package com.example.newfermiapp;

public class QuestionAnswerMKT {
    public static String question[] = {
            "Как называется величина, характеризующая массу одного моля вещества?",
            "Какая единица измерения соответствует молярной массе?",
            "Диффузия происходит быстрее при повышении температуры вещества, потому что",
            "Молекулы вещества?",
            "Броуновское движение мелких частиц может наблюдаться",
            "Какова среднеквадратическая скорость молекул азота (м/с) при температуре 7°С? (М=28 г/моль, k = 1,38•10-23Дж/К)",
            "Какова масса одной молекулы воды (г), если ее молярная масса равна 18 г?",
            "Определите отношение числа молекул в 36 г воды к числу молекул в 2 г водорода.",
            "Какое количество вещества (ноль) содержится в 144 г воды? ?(Н)=1 а.е.м., ?(O)=16 а.е.м.",
            "Оцените среднеквадратическую скорость молекул водорода при температуре 80 К (м/с), к = 1,38•10-23Дж/К."




    };

    public static String choices[][] = {
            {"молярная масса", "масса моля", "масса молекулы", "масса вещества"},
            {"кг", "кг/моль", "моль", "1/моль"},
            {"увеличивается скорость движения частиц", "увеличивается взаимодействие частиц", "тело при нагревании расширяется", "уменьшается скорость движения частиц"},
            {"только притягиваются друг к другу", "только отталкиваются друг от друга", "могут и притягиваться, и отталкиваться друг от друга", "не взаимодействуют друг с другом"},
            {"только в жидкостях", "только в газах", "только в жидкостях и в газах", "в жидкостях, газах и в твёрдых телах"},
            {"840", "500", "720", "900"},
            {"10-23", "3•10-23", "3•10-24", "10-26"},
            {"0,5", "1", "2", "3"},
            {"6","8","4","10"},
            {"500","1200","1000","800"}


    };

    public static String correctAnswers[] = {
            "молярная масса",
            "моль",
            "увеличивается скорость движения частиц",
            "могут и притягиваться, и отталкиваться друг от друга",
            "только в жидкостях и в газах",
            "500",
            "3•10-23",
            "2",
            "8",
            "1000"

    };
}
