package com.example.newfermiapp;

public class QuestionAnswerMagn {
    public static String question[] = {
            "С движением каких частиц в атоме связано появление магнитных свойств?",
            "Какой формы бывают обычно постоянные магниты?",
            "Какие места постоянного магнита оказывают наибольшее магнитное действие? Как их называют?",
            "Какое из названных здесь веществ хорошо притягивается к магниту?",
            "Какое из ниженазванных веществ не притягивается к магниту?",
            "Как взаимодействуют разноименные полюсы магнитов?",
            "Что называют постоянными магнитами?",
            "Какого полюса у магнита нет?",
            "В области, где магнитные линии сгущаются, действие магнитного поля?",
            "Какое явление используется в устройстве электродвигателей?"




    };

    public static String choices[][] = {
            {"Ядер атомов", "Протонов в ядре атома", "Нейтронов в ядре атома", "Электронов"},
            {"Шарообразной", "Дугообразной", "Цилиндрической", "Полосовой"},
            {"Их концы; южный и северный полюсы", "Находящиеся в середине магнита; полюсы", "Все места оказывают одинаковое действие", "Среди ответов нет правильного"},
            {"Полиэтилен", "Чугун", "Древесина", "Медь"},
            {"Сталь", "Магнитный сплав", "Кобальт", "Резина"},
            {"Отталкиваются друг от друга", "Не реагируют на присутствие друг друга", "Притягиваются друг к другу", "Притягиваются друг к другу только при очень малом расстоянии между ними"},
            {"Тела, длительно сохраняющие намагниченность", "Тела, кратковременно сохраняющие намагниченность", "Тела, не сохраняющие намагниченность", "Все"},
            {"Северного", "Южного", "Центрального", "Верхнего"},
            {"Уменьшаются","Увеличиваются","Не изменяются","Незнаю"},
            {"Вращение рамки в магнитном поле","Вращение рамки с током в магнитном поле","Вращение рамки с током", "Вращение контура"}


    };

    public static String correctAnswers[] = {
            "Электронов",
            "Дугообразной",
            "Их концы; южный и северный полюсые",
            "Чугун",
            "Резина",
            "Притягиваются друг к другу",
            "Тела, длительно сохраняющие намагниченность",
            "Центрального",
            "Увеличиваются",
            "Вращение рамки с током в магнитном поле"

    };
}
