package com.example.newfermiapp;

public class QuestionAnswerQuant {
    public static String question[] = {
            "Каким выражением определяется импульс фотона с энергией E?",
            "В каких единицах измеряется постоянная Планка?",
            "Определите импульс фотона (кг•м)/с, длина волны которого 4,41•10-7м? (h = 6,62•10-34Дж•с)?",
            "Какое из приведенных выражений соответствует массе фотона с длиной волны л?",
            "Чему равна красная граница (м) фотоэффекта для вещества с работой выхода электронов 6•10-19Дж. h = 6,6•10-34Дж•с.",
            "Определите импульс фотона (кг•м)/c, длина волны которого равна 500 нм. h = 6,62•10-34Дж•с",
            "Что такое фотон? Это...",
            "Какое из перечисленных ниже оптических явлений получило объяснение на основе квантовой теории света?",
            "Определите массу фотона (кг) с длиной волны 220 нм. h = 6,6•10-34Дж•с",
            "Укажите верное утверждение. Электроны, двигаясь в атоме по стационарным орбитам…"




    };

    public static String choices[][] = {
            {"c / E", "hv / E", "E / hc", "E / c"},
            {"Дж", "Дж/с", "Дж•с", "Дж/м"},
            {"1,5•10-27", "2,21•10-26", "1,5•10-41", "2,21•10-41"},
            {"h / λc", "hc / λ", "hλc", "hλc2"},
            {"6,6•10-8", "3,3•10-7", "3•10-7", "6,6•10-6"},
            {"2,7•10-27°", "2,6•10-26°", "1,3•10-25°", "1,3•10-27"},
            {"нейтральная частица, способная перемещаться в пустоте со скоростью от 200 до 300 тысяч км/с", "частица, обладающая массой электрона, но имеющая заряд противоположного знака", "квант электромагнитного излучения", "дырка в твердом теле"},
            {"дифракция", "дисперсия", "фотоэффект", "интерференция"},
            {"3•10-36", "1,6•10-36", "1•10-35", "1,5•10-36"},
            {"излучают свет и теряют энергию","излучают свет, но не теряют энергию","не излучают свет, но теряют энергию", "не излучают свет и не теряют энергию"}


    };

    public static String correctAnswers[] = {
            "E / c",
            "Дж•с",
            "1,5•10-27",
            "h / λc",
            "3,3•10-7",
            "1,3•10-27",
            "квант электромагнитного излучения",
            "фотоэффект",
            "1•10-35",
            "не излучают свет и не теряют энергию"

    };
}
