package com.example.newfermiapp;

public class QuestionAnswerElectro {
    public static String question[] = {
            "Как называется процесс , приводящий к появлению у тела электрического заряда?",
            "Каким свойством обладают наэлектризованные тела?",
            "Какие заряды вы знаете?",
            "Как ведут себя одноименные заряды?",
            "Можно ли уменьшать электрический заряд бесконечно?",
            "Как называют модель атом, созданную Резерфордом?",
            "У какого элемента самое простое ядро?",
            "Какой заряд прошел по спирали утюга если им гладили 1,5 часа. Сила тока в сети 3 А?",
            "Какой буквой обозначается: напряжение, сила тока, сопротивление, колличество заряда?",
            "Какова сила тока в цени, если напряжение на лампе накаливания 2 вольта, а сопротивление лампы 10 Ом."




    };

    public static String choices[][] = {
            {"дегазация", "сопротивление", "электризация", "вулканизация"},
            {"отталкивать от себя различные предметы", "притягивать к себе различные предметы", "взаимодействовать друг с другом", "никаких свойств не проявляют"},
            {"положительные и отрицательные", "отрицательные и незаряженные тела", "положительные и незаряженные тела", "зарядов в природе не существует"},
            {"притягиваются", "отталкиваются", "не обнаруживают взаимодействия", "притягиваются и отталкиваются одновременно"},
            {"да", "нет", "до определённого значения", "до величины одного электрона"},
            {"планетная", "планетарная", "околопланетная", "земная"},
            {"Водород", "Литий", "Гелий", "Бериллий"},
            {"1292 Кл", "300 Кл", "15 Кл", "16 200 Кл"},
            {"U, I, R, q","R, I, U, q","q, I,U,R","U, I, q, R"},
            {"0,1 А","0,2 А","0,6 А", "0,3 А"}


    };

    public static String correctAnswers[] = {
            "электризация",
            "притягивать к себе различные предметы",
            "положительные и отрицательные",
            "отталкиваются",
            "до определённого значения",
            "планетарная",
            "Водород",
            "16 200 Кл",
            "U, I, R, q",
            "0,2 А"

    };
}
