package com.example.newfermiapp;

public class QuestionAnswerOpt {
    public static String question[] = {
            "Определите скорость света (м/с) в алмазе (n=2,4)?",
            "Кристалл можно использовать в качестве дифракционной решетки для...",
            "Какие из нижеперечисленных волн обладают свойством поляризуемости. 1) звуковые; 2) радиоволны; 3) световые?",
            "У какого из следующих излучений скорость распространения в стекле наибольшая?",
            "В центре выпуклой линзы приклеили монету. Как этот факт повлияет на действительное изображение предмета?",
            "Рост человека 180 см, длина его тени от Солнца равна 311 см. Оцените угловую высоту Солнца над горизонтом.",
            "Угол падения равен 60°, а угол преломления – 30 °. Определите показатель преломления второй среды относительно первой",
            "Угол между плоскостью зеркала и падающим лучом равен 35°. Найдите угол отражения.",
            "Длина тени от здания неизвестной высоты равна 10 м Длина тени от столба высотой 2 м равна 1 м. Какова высота здания (м)?",
            "Какова оптическая сила линзы (дптр), фокусное расстояние которой равно 12,5 см?"




    };

    public static String choices[][] = {
            {"1,5•10*8", "1,25•10*8", "2,40•10*8", "1,35•10*8"},
            {"ультрафиолетовых лучей", "длинных радиоволн", "рентгеновских лучей", "видимого света"},
            {"только 2", "2 и 3", "только 3", "только 1"},
            {"инфракрасного", "красного", "ультрафиолетового", "синего"},
            {"исчезнет центральная часть изображения", "исчезнет периферийная часть изображения", "изображение станет нерезким", "уменьшится яркость всего изображения"},
            {"45°", "60°", "30°", "15°"},
            {"√2", "1,2", "1,5", "√3"},
            {"65°", "45°", "55°", "35°"},
            {"10", "20", "40", "30"},
            {"8","0.08","4", "0.16"}


    };

    public static String correctAnswers[] = {
            "1,25•10*8",
            "рентгеновских лучей",
            "2 и 3",
            "инфакрасного",
            "уменьшится яркость всего изображения",
            "30°",
            "√3",
            "55°",
            "20",
            "8"

    };
}
